{"class_name": "Sequential", "config": {"layers": [{"class_name": "Conv2D", "config": {"trainable": true, "filters": 32, "padding": "same", "dilation_rate": [1, 1], "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "name": "conv2d_1", "activation": "linear", "bias_constraint": null, "activity_regularizer": null, "kernel_constraint": null, "strides": [1, 1], "kernel_regularizer": null, "batch_input_shape": [null, 48, 48, 1], "bias_regularizer": null, "dtype": "float32", "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "kernel_size": [3, 3]}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "pool_size": [2, 2], "padding": "valid", "data_format": "channels_last", "name": "max_pooling2d_1", "strides": [2, 2]}}, {"class_name": "BatchNormalization", "config": {"epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "axis": -1, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_1", "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_1", "activation": "relu"}}, {"class_name": "Dropout", "config": {"noise_shape": null, "trainable": true, "rate": 0.5, "name": "dropout_1", "seed": null}}, {"class_name": "Conv2D", "config": {"trainable": true, "filters": 64, "padding": "same", "dilation_rate": [1, 1], "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "name": "conv2d_2", "activation": "linear", "bias_constraint": null, "activity_regularizer": null, "kernel_constraint": null, "strides": [1, 1], "kernel_regularizer": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "kernel_size": [3, 3]}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "pool_size": [2, 2], "padding": "valid", "data_format": "channels_last", "name": "max_pooling2d_2", "strides": [2, 2]}}, {"class_name": "BatchNormalization", "config": {"epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "axis": -1, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_2", "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_2", "activation": "relu"}}, {"class_name": "Dropout", "config": {"noise_shape": null, "trainable": true, "rate": 0.5, "name": "dropout_2", "seed": null}}, {"class_name": "Conv2D", "config": {"trainable": true, "filters": 128, "padding": "same", "dilation_rate": [1, 1], "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "name": "conv2d_3", "activation": "linear", "bias_constraint": null, "activity_regularizer": null, "kernel_constraint": null, "strides": [1, 1], "kernel_regularizer": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "kernel_size": [3, 3]}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "pool_size": [2, 2], "padding": "valid", "data_format": "channels_last", "name": "max_pooling2d_3", "strides": [2, 2]}}, {"class_name": "BatchNormalization", "config": {"epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "axis": -1, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_3", "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_3", "activation": "relu"}}, {"class_name": "Dropout", "config": {"noise_shape": null, "trainable": true, "rate": 0.5, "name": "dropout_3", "seed": null}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1", "data_format": "channels_last"}}, {"class_name": "Dense", "config": {"trainable": true, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "name": "dense_1", "activation": "linear", "bias_constraint": null, "activity_regularizer": null, "units": 64, "kernel_constraint": null, "kernel_regularizer": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "BatchNormalization", "config": {"epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "axis": -1, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_4", "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_4", "activation": "relu"}}, {"class_name": "Dropout", "config": {"noise_shape": null, "trainable": true, "rate": 0.5, "name": "dropout_4", "seed": null}}, {"class_name": "Dense", "config": {"trainable": true, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "name": "dense_2", "activation": "linear", "bias_constraint": null, "activity_regularizer": null, "units": 128, "kernel_constraint": null, "kernel_regularizer": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "BatchNormalization", "config": {"epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "axis": -1, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_5", "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_5", "activation": "relu"}}, {"class_name": "Dropout", "config": {"noise_shape": null, "trainable": true, "rate": 0.5, "name": "dropout_5", "seed": null}}, {"class_name": "Dense", "config": {"trainable": true, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "name": "dense_3", "activation": "sigmoid", "bias_constraint": null, "activity_regularizer": null, "units": 7, "kernel_constraint": null, "kernel_regularizer": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}], "name": "sequential_1"}, "backend": "tensorflow", "keras_version": "2.2.4"}